---
kind: property
id: P:Autodesk.Revit.DB.ViewDisplaySketchyLines.EnableSketchyLines
source: html/7ee07699-de65-b4f0-9fd9-1a25ab74a31f.htm
---
# Autodesk.Revit.DB.ViewDisplaySketchyLines.EnableSketchyLines Property

True to enable sketchy lines visibility. False to disable it.

## Syntax (C#)
```csharp
public bool EnableSketchyLines { get; set; }
```